twwawy/Hexapod-Robot/SW/STM32/workspace/Hexapod/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define CS2_Pin GPIO_PIN_0
#define CS2_GPIO_Port GPIOC
#define CS3_Pin GPIO_PIN_1
#define CS3_GPIO_Port GPIOC
#define INA1_Pin GPIO_PIN_2
#define INA1_GPIO_Port GPIOC
#define INB1_Pin GPIO_PIN_3
#define INB1_GPIO_Port GPIOC
#define CS1_Pin GPIO_PIN_4
#define CS1_GPIO_Port GPIOA
#define INC1_Pin GPIO_PIN_4
#define INC1_GPIO_Port GPIOC
#define INA2_Pin GPIO_PIN_5
#define INA2_GPIO_Port GPIOC
#define INC2_Pin GPIO_PIN_2
#define INC2_GPIO_Port GPIOB
#define DRDY_Pin GPIO_PIN_9
#define DRDY_GPIO_Port GPIOC
#define INB2_Pin GPIO_PIN_12
#define INB2_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
